## 🧾 Terraform Plan for `sec_securityhub`

> ⚠️ Review this carefully before applying changes

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.sec_compliance_findings_advanced.aws_cloudwatch_event_rule.securityhub_findings[0] will be created
  + resource "aws_cloudwatch_event_rule" "securityhub_findings" {
      + arn            = (known after apply)
      + description    = "Forward SecurityHub findings to EventBridge target"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail-type = [
                  + "Security Hub Findings - Imported",
                ]
              + source      = [
                  + "aws.securityhub",
                ]
            }
        )
      + id             = (known after apply)
      + is_enabled     = true
      + name           = "SecurityHubFindingsRule"
      + name_prefix    = (known after apply)
      + tags_all       = (known after apply)
    }

  # module.sec_compliance_findings_advanced.aws_cloudwatch_event_target.eventbridge_target[0] will be created
  + resource "aws_cloudwatch_event_target" "eventbridge_target" {
      + arn            = "arn:aws:sns:us-east-1:123456789012:SecurityFindingsTopic"
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "SecurityHubFindingsRule"
      + target_id      = "SendToTarget"
    }

  # module.sec_compliance_findings_advanced.aws_config_configuration_recorder.default[0] will be created
  + resource "aws_config_configuration_recorder" "default" {
      + id       = (known after apply)
      + name     = "default"
      + role_arn = "arn:aws:iam::123456789012:role/AWSConfigRecorderRole"

      + recording_group {
          + all_supported                 = true
          + include_global_resource_types = true
        }
    }

  # module.sec_compliance_findings_advanced.aws_config_configuration_recorder_status.default[0] will be created
  + resource "aws_config_configuration_recorder_status" "default" {
      + id         = (known after apply)
      + is_enabled = true
      + name       = "default"
    }

  # module.sec_compliance_findings_advanced.aws_config_delivery_channel.default[0] will be created
  + resource "aws_config_delivery_channel" "default" {
      + id             = (known after apply)
      + name           = "default"
      + s3_bucket_name = "company-compliance-archive"

      + snapshot_delivery_properties {
          + delivery_frequency = "TwentyFour_Hours"
        }
    }

  # module.sec_compliance_findings_advanced.aws_s3_bucket.config_snapshot[0] will be created
  + resource "aws_s3_bucket" "config_snapshot" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "company-compliance-archive"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "compliance"
          + "Name"        = "aws-config-snapshot-archive"
        }
      + tags_all                    = {
          + "Environment" = "compliance"
          + "Name"        = "aws-config-snapshot-archive"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + lifecycle_rule {
          + enabled = true
          + id      = (known after apply)

          + expiration {
              + days = 365
            }

          + transition {
              + days          = 30
              + storage_class = "GLACIER"
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }
    }

  # module.sec_compliance_findings_advanced.aws_securityhub_account.main[0] will be created
  + resource "aws_securityhub_account" "main" {
      + arn                       = (known after apply)
      + auto_enable_controls      = true
      + control_finding_generator = "SECURITY_CONTROL"
      + enable_default_standards  = true
      + id                        = (known after apply)
    }

  # module.sec_compliance_findings_advanced.aws_securityhub_finding_aggregator.aggregator[0] will be created
  + resource "aws_securityhub_finding_aggregator" "aggregator" {
      + id           = (known after apply)
      + linking_mode = "ALL_REGIONS"
    }

  # module.sec_compliance_findings_advanced.aws_securityhub_member.members["111122223333"] will be created
  + resource "aws_securityhub_member" "members" {
      + account_id    = "111122223333"
      + email         = "security@example.com"
      + id            = (known after apply)
      + invite        = true
      + master_id     = (known after apply)
      + member_status = (known after apply)
    }

  # module.sec_compliance_findings_advanced.aws_securityhub_member.members["444455556666"] will be created
  + resource "aws_securityhub_member" "members" {
      + account_id    = "444455556666"
      + email         = "audit@example.com"
      + id            = (known after apply)
      + invite        = true
      + master_id     = (known after apply)
      + member_status = (known after apply)
    }

  # module.sec_compliance_findings_advanced.aws_securityhub_product_subscription.third_party_products["arn:aws:securityhub:us-east-1::product/aws/guardduty"] will be created
  + resource "aws_securityhub_product_subscription" "third_party_products" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + product_arn = "arn:aws:securityhub:us-east-1::product/aws/guardduty"
    }

  # module.sec_compliance_findings_advanced.aws_securityhub_product_subscription.third_party_products["arn:aws:securityhub:us-east-1::product/aws/inspector"] will be created
  + resource "aws_securityhub_product_subscription" "third_party_products" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + product_arn = "arn:aws:securityhub:us-east-1::product/aws/inspector"
    }

  # module.sec_compliance_findings_advanced.aws_securityhub_standards_subscription.cis[0] will be created
  + resource "aws_securityhub_standards_subscription" "cis" {
      + id            = (known after apply)
      + standards_arn = "arn:aws:securityhub:::standards/cis-aws-foundations-benchmark/v/1.4.0"
    }

  # module.sec_compliance_findings_basic.aws_securityhub_account.main[0] will be created
  + resource "aws_securityhub_account" "main" {
      + arn                       = (known after apply)
      + auto_enable_controls      = true
      + control_finding_generator = "SECURITY_CONTROL"
      + enable_default_standards  = true
      + id                        = (known after apply)
    }

  # module.sec_compliance_findings_basic.aws_securityhub_finding_aggregator.aggregator[0] will be created
  + resource "aws_securityhub_finding_aggregator" "aggregator" {
      + id           = (known after apply)
      + linking_mode = "ALL_REGIONS"
    }

  # module.sec_compliance_findings_basic.aws_securityhub_member.members["111122223333"] will be created
  + resource "aws_securityhub_member" "members" {
      + account_id    = "111122223333"
      + email         = "security@example.com"
      + id            = (known after apply)
      + invite        = true
      + master_id     = (known after apply)
      + member_status = (known after apply)
    }

  # module.sec_compliance_findings_basic.aws_securityhub_member.members["444455556666"] will be created
  + resource "aws_securityhub_member" "members" {
      + account_id    = "444455556666"
      + email         = "audit@example.com"
      + id            = (known after apply)
      + invite        = true
      + master_id     = (known after apply)
      + member_status = (known after apply)
    }

  # module.sec_compliance_findings_basic.aws_securityhub_standards_subscription.cis[0] will be created
  + resource "aws_securityhub_standards_subscription" "cis" {
      + id            = (known after apply)
      + standards_arn = "arn:aws:securityhub:::standards/cis-aws-foundations-benchmark/v/1.4.0"
    }

Plan: 18 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with provider["registry.terraform.io/hashicorp/aws"],
  on providers.tf line 7, in provider "aws":
   7:   s3_force_path_style         = true

Use s3_use_path_style instead.

(and 5 more similar warnings elsewhere)

Warning: Attribute Deprecated

  with provider["registry.terraform.io/hashicorp/aws"],
  on providers.tf line 7, in provider "aws":
   7:   s3_force_path_style         = true

Use s3_use_path_style instead.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

<!-- Sticky Pull Request Comment -->